app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.create(restaurant_params)
---
INSERT INTO "restaurants" ("name", "rating", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Johnnies"], ["rating", 5], ["description", "Good place"], ["created_at", 2016-11-15 13:18:55 UTC], ["updated_at", 2016-11-15 13:18:55 UTC]]

  def show
    @restaurant = Restaurant.find(params[:id])
    @reviews = @restaurant.reviews
    @average_score = @reviews.sum(:rating) / @reviews.count.to_f
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 1]]

  def edit
    @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def update
    @restaurant = Restaurant.find(params[:id])
    @restaurant.update(restaurant_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "restaurants" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "restaurants"."id" = $4  [["name", "trat"], ["description", ""], ["updated_at", 2016-11-15 09:26:33 UTC], ["id", 18]]

  def destroy
    @restaurant = Restaurant.find(params[:id])
    @restaurant.destroy
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 1]]