app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def new
    @user = current_user
    @restaurant = Restaurant.find(params[:restaurant_id])

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("comments", "rating", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comments", "It's good."], ["rating", 4], ["restaurant_id", 1], ["created_at", 2016-11-15 17:30:43 UTC], ["updated_at", 2016-11-15 17:30:43 UTC]]
---
  def create
    @current_user = current_user
    @restaurant = Restaurant.find(params[:restaurant_id])
    @output = @restaurant.build_review_with_user_foreign_key(reviews_params, @current_user)
    ReviewedRestaurant.create(user_id: @current_user.id, restaurant_id: @restaurant.id)